# Exercice pandas à rendre
## Écrire programme Pandas pour créer et afficher un DataFrame à partir des données de dictionnaire suivantes avec des étiquettes d'index.

In [1]:
# ecrivons le DatFrme
# importer d'abord les deux bibliothèques suivantes: pandas et numpy
import pandas as pd
import numpy as np
# create DataFrame
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthieu', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 
          'f', 'g', 'h', 'i', 'j']
data = pd.DataFrame(exam_data, index=labels)

In [4]:
# exécutons le programme.
print(data)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g   Matthieu   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [5]:
# Imprimons les trois premières lignes en utilisant la méthode head()
data.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [6]:
print(data)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g   Matthieu   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [7]:
# Supprimons les lignes avec des valeurs Nan.
data.dropna()

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g   Matthieu   14.5         1     yes
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [8]:
# faisons l'Extraction les colonnes 'name' et 'score' du DataFrame.
name_score = data[['name', 'score']]

In [9]:
print(name_score)

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g   Matthieu   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [11]:
# Écrire un programme Pandas pour ajouter une nouvelle ligne 'k'
#au DataFrame avec ces valeurs (nom : "Suresh", score : 15,5, attempts : 1, qualification : "oui").
# 1. ajouter  une nouvelle ligne
new_row = pd.DataFrame({'name': 'Suresh', 'score': 15.5, 'attempts': 1, 'qualify': 'yes'},index=['k'])
data = pd.concat([data, new_row])

In [12]:
print(data)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g   Matthieu   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

In [13]:
# supprimer la colonne attempts axe=1
data = data.drop('attempts', axis=1)

In [14]:
print(data)

        name  score qualify
a  Anastasia   12.5     yes
b       Dima    9.0      no
c  Katherine   16.5     yes
d      James    NaN      no
e      Emily    9.0      no
f    Michael   20.0     yes
g   Matthieu   14.5     yes
h      Laura    NaN      no
i      Kevin    8.0      no
j      Jonas   19.0     yes
k     Suresh   15.5     yes

In [15]:
# Ajouter une nouvelle colonne "Succès" : si le score est supérieur à 10, nous aurons 1, sinon nous aurons 0.
data["Success"] = (data["score"] > 10).astype(int)

In [16]:
print(data)

        name  score qualify  Success
a  Anastasia   12.5     yes        1
b       Dima    9.0      no        0
c  Katherine   16.5     yes        1
d      James    NaN      no        0
e      Emily    9.0      no        0
f    Michael   20.0     yes        1
g   Matthieu   14.5     yes        1
h      Laura    NaN      no        0
i      Kevin    8.0      no        0
j      Jonas   19.0     yes        1
k     Suresh   15.5     yes        1

In [8]:
import pandas as pd
import numpy as np
# create DataFrame
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthieu', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 
          'f', 'g', 'h', 'i', 'j']
data = pd.DataFrame(exam_data, index=labels)

In [ ]:
import pandas as pd
import numpy as np
# create DataFrame
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthieu', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 
          'f', 'g', 'h', 'i', 'j']
data = pd.DataFrame(exam_data, index=labels)

In [9]:
# Exporter les données en tant que fichier Excel
data.to_excel('ma première donnée.xlsx', index=False)